Autodesk.Revit.DB.Lighting.LightGroup.Name
The name of the LightGroup
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: name cannot include prohibited characters.
-or-
When setting this property: The name is not valid because it is not unique within this LightGroupManager
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013